data_collection_manual/jmeter_tests/loc_ret_jmeter_tests/loc_ret.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="locsim test plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="filename">/Users/dtfernando/Documents/cloudslab/iAnomaly_toolkit/applications/location_retrieval_app/jmeter_tests/vehicle_ids.csv</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="variableNames">vehicleID</stringProp>
      </CSVDataSet>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1708703314">
            <stringProp name="48628">103</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1609213596">
            <stringProp name="1818">93</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="152958886">
            <stringProp name="48634">109</stringProp>
            <stringProp name="50">2</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1669719117">
            <stringProp name="1819">94</stringProp>
            <stringProp name="51">3</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="14847810">
            <stringProp name="48630">105</stringProp>
            <stringProp name="52">4</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="121261262">
            <stringProp name="48633">108</stringProp>
            <stringProp name="53">5</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="17111926">
            <stringProp name="48630">105</stringProp>
            <stringProp name="54">6</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1674247349">
            <stringProp name="1819">94</stringProp>
            <stringProp name="55">7</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-803481169">
            <stringProp name="48627">102</stringProp>
            <stringProp name="56">8</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="160883292">
            <stringProp name="48634">109</stringProp>
            <stringProp name="57">9</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1091521701">
            <stringProp name="48632">107</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="132681036">
            <stringProp name="48687">120</stringProp>
            <stringProp name="1568">11</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1293426595">
            <stringProp name="48659">113</stringProp>
            <stringProp name="1569">12</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-994790324">
            <stringProp name="48634">109</stringProp>
            <stringProp name="1570">13</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1415014714">
            <stringProp name="1824">99</stringProp>
            <stringProp name="1571">14</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="523101965">
            <stringProp name="1819">94</stringProp>
            <stringProp name="1572">15</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1382185032">
            <stringProp name="1823">98</stringProp>
            <stringProp name="1573">16</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="455178485">
            <stringProp name="1817">92</stringProp>
            <stringProp name="1574">17</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1703861206">
            <stringProp name="1793">89</stringProp>
            <stringProp name="1575">18</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1315393610">
            <stringProp name="1821">96</stringProp>
            <stringProp name="1576">19</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1022078880">
            <stringProp name="48631">106</stringProp>
            <stringProp name="1598">20</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1457913754">
            <stringProp name="1823">98</stringProp>
            <stringProp name="1599">21</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-2095198060">
            <stringProp name="1823">98</stringProp>
            <stringProp name="1600">22</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1100816493">
            <stringProp name="48628">103</stringProp>
            <stringProp name="1601">23</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1204965829">
            <stringProp name="48625">100</stringProp>
            <stringProp name="1602">24</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1204839209">
            <stringProp name="1815">90</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1876539164">
            <stringProp name="1790">86</stringProp>
            <stringProp name="1604">26</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1277290921">
            <stringProp name="1817">92</stringProp>
            <stringProp name="1605">27</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1843816494">
            <stringProp name="48691">124</stringProp>
            <stringProp name="1606">28</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="2111517246">
            <stringProp name="48658">112</stringProp>
            <stringProp name="1607">29</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1740355181">
            <stringProp name="1789">85</stringProp>
            <stringProp name="1629">30</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-70405385">
            <stringProp name="48634">109</stringProp>
            <stringProp name="1630">31</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1102693326">
            <stringProp name="48625">100</stringProp>
            <stringProp name="1631">32</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-615785218">
            <stringProp name="1762">79</stringProp>
            <stringProp name="1632">33</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-207384403">
            <stringProp name="48630">105</stringProp>
            <stringProp name="1633">34</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1190396856">
            <stringProp name="48663">117</stringProp>
            <stringProp name="1634">35</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-1119077202">
            <stringProp name="48665">119</stringProp>
            <stringProp name="1635">36</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1381827540">
            <stringProp name="1817">92</stringProp>
            <stringProp name="1636">37</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-2018962891">
            <stringProp name="1822">97</stringProp>
            <stringProp name="1637">38</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="-2017830833">
            <stringProp name="1822">97</stringProp>
            <stringProp name="1638">39</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="49">1</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">100.88.28.171</stringProp>
          <stringProp name="HTTPSampler.port">9090</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/get_location/${vehicleID}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <TestAction guiclass="TestActionGui" testclass="TestAction" testname="Think Time">
          <intProp name="ActionProcessor.action">1</intProp>
          <intProp name="ActionProcessor.target">0</intProp>
          <stringProp name="ActionProcessor.duration">0</stringProp>
        </TestAction>
        <hashTree>
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Pause">
            <stringProp name="ConstantTimer.delay">997</stringProp>
            <stringProp name="RandomTimer.range">20</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>
        <LoopController guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
        </LoopController>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>